app/Http/Controllers/HomeController.php

select * from `advertisements` where `on_off` = '1' order by `categories_id` asc
select * from `giaodiens` order by `created_at` desc
select * from `categories` order by `location` asc
select * from `advertisement1s` where `on_off` = '1' order by `created_at` desc
---
    public function __construct()
    {

        $advertisements=Advertisement::where('on_off','1')->orderBy('categories_id','asc')->get();
        //footer
        $giaodiens=Giaodien::orderBy('created_at','desc')->get();
        //menu
        $categories=Category::orderBy('location','asc')->get();
        //banner bên phải
        $ad_rights=Advertisement1::where('on_off','1')->orderBy('created_at','desc')->get();

select * from `videos` where `on_off` = '1' order by `created_at` desc
select * from `posts` where `On_Off` = '1' order by `updated_at` desc
---
    public function index()
    {
        $videos=Video::where('on_off','1')->orderBy('created_at','desc')->get();

        $posts=Post::where('On_Off','1')->orderBy('updated_at','desc')->get();